Tekla Open API Reference for Tekla Structures 2025
PlacingDistanceAttributes Constructor (Double, Double, Double)
 Creates a new placing distance attributes instance with the given search margin, minimal and maximal distance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDistanceAttributes(
	double searchMargin,
	double minimalDistance,
	double maximalDistance
)
Public Sub New (
	searchMargin As Double,
	minimalDistance As Double,
	maximalDistance As Double
)
Parameters
searchMargin
Type: System.Double
The search margin to be used.
minimalDistance
Type: System.Double
The minimal distance to be used.
maximalDistance
Type: System.Double
The maximal distance to be used.
See Also
Reference
PlacingDistanceAttributes Class
PlacingDistanceAttributes Overload
Tekla.Structures.Drawing Namespace